[
  {
    "course_code": "AUT0101",
    "course_name": "Αγγλικά Ι",
    "semester": "Α' Εξάμηνο",
    "description": "**Στόχος:** Οι σπουδαστές/στριες, μέσα από τη διδασκαλία του μαθήματος, να καταστούν ικανοί/ές να τ ηρούν τις τεχνικές οδηγίες οι οποίες δίδονται σε διάφορα εγχειρίδια στην αγγλική γλώσσα. Παράλληλα, να παρέχουν ικανοποιητική και αποτελεσματική πληροφόρηση σε πελάτες και προσωπικό στην αγγλική γλώσσα.\n\n**Μαθησιακά Αποτελέσματα:** Στο τέλος των μαθημάτων, οι σπουδαστές/στριες θα είναι σε θέση να:  Τηρούν τις τεχνικές οδηγίες οι οποίες δίδονται σε τεχνικά εγχειρίδια (workshop manuals, service bulletins, Technical Catalogs)  Χειρίζονται με άνεση διαγνωστικά συστήματα σε αγγλόφωνο περιβάλλον τηρώντας τις τεχνικές οδηγίες οι οποίες δίδονται.  Παρέχουν ικανοποιητική και αποτελεσματική πληροφόρηση σε πελάτες όσον αφορά τη φύση της βλάβης στο όχημά τους, τον τρόπο επιδιόρθωσης, το αναμενόμενο κόστος και χρόνο ολοκλήρωσης της εργασίας.  Παρέχουν ικανοποιητική και αποτελεσματική πληροφόρηση σε προϊστάμενους στο συνεργείο για τεχνικά θέματα και πιθανά προβλήματα που παρουσιάζονται στην εκτέλεση των εργασιών.\n\n**Περιεχόμενο:** Grammar (2 hours per week): Introduction to the English language. Word order, sentence structure, and meaning. Affirmative and negative statements. Quantifiers (many, much, some, several, etc.). Suffixes (-ful, -ity, -ly). Plural forms (regular and irregular). Verb Tenses: Present time tenses, past time tenses, present and past time tenses, and future time tenses. Irregular verbs. Passives Modals and related verbs. Conditionals: Types of conditionals, modal verbs in conditionals and wish. Verbs with –ing and or infinitive. Phrasal Verbs. Separable/inseparable phrasal verbs. Phrasal verbs with preposition. Relative clauses and relative pronouns. Combining sentences. Nouns, pronouns and articles: Countable and uncountable nouns, pronouns, determiners, possessive nouns, compound nouns, and articles. Adjectives and adverbs: Comparing, adverbs of degree and time adverbs. Prepositions: prepositions of place, verbs + preposition, adjective + preposition, noun + preposition. Vocabulary (1 hour per week): Readings and discussions aiming to enrich students’ vocabulary (colour, shape, size, Place, position, location, means, quantifiers, time, reason, frequency, people, jobs, places to visit, festivals/celebrations, disasters/accidents, eating habits, sports/hobbies, environment, education, entertainment, transport, crime, etc.) Διαλέξεις με χρήση Πολυμέσων, Συζητήσεις, Περιπτωσιακές Μελέτες Βασική",
    "credits": 3,
    "periods_per_week": 2.0,
    "hours_per_week": 2.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 20
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 40
      }
    ]
  },
  {
    "course_code": "AUT0102",
    "course_name": "Μαθηματικά",
    "semester": "Α' Εξάμηνο",
    "description": "**Στόχος:** Οι σπουδαστές/στριες, μέσα από τη διδασκαλία του μαθήματος, να αποκτήσουν τις απαραίτητες επιστημονικές γνώσεις έτσι ώστε να καταστούν ικανοί/ές να ε κτελούν απλούς μαθηματικούς υπολογισμούς χρήσιμους στην επιχείρηση και στο συνεργείο.\n\n**Μαθησιακά Αποτελέσματα:** Στο τέλος των μαθημάτων, οι σπουδαστές/στριες θα είναι σε θέση να:  Εκτελούν απλούς μαθηματικούς υπολογισμούς που αφορούν το κόστος επιδιόρθωσης, το κέρδος του συνεργείου, τις εισπράξεις και έξοδα της ημέρας, του μήνα, τη διεκπεραίωση βασικών τραπεζικών εργασιών και συναλλαγών  Εκτελούν απλούς μαθηματικούς υπολογισμούς που δύναται να είναι χρήσιμοι κατά την ρύθμιση ή και επιδιόρθωση οχημάτων στο συνεργείο.\n\n**Περιεχόμενο:** Οικονομικά Μαθηματικά:  Κλάσματα, μέθοδος των τριών. Ασκήσεις προβλημάτων εφαρμογής στην ενότητα της εβδομαδιαίας θεωρίας.  Προσθαφαίρεση ποσοστών Ασκήσεις προβλημάτων εφαρμογής στην ενότητα της εβδομαδιαίας θεωρίας. Τεχνικά Μαθηματικά:  Υπολογισμός εμβαδού κύκλου και όγκου",
    "credits": 2,
    "periods_per_week": 2.0,
    "hours_per_week": 2.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 20
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 40
      }
    ]
  },
  {
    "course_code": "AUT0103",
    "course_name": "Οργάνωση, Λειτουργία & Ασφάλεια Συνεργείου",
    "semester": "Α' Εξάμηνο",
    "description": "**Στόχος:** Βασικός στόχος αυτού του μαθήματος είναι να κατανοήσουν οι σπουδαστές/τριες τις βασικές αρχές Οργάνωσης, Λειτουργίας και Ασφάλειας στο συνεργείο οχημάτων και να γνωρίσουν τη νομοθεσία η οποία διέπει την Ασφάλεια και Υγεία στην Εργασία .\n\n**Μαθησιακά Αποτελέσματα:** Στο τέλος των μαθημάτων, οι σπουδαστές/τριες θα είναι σε θέση να:  Γνωρίζουν και εφαρμόζουν βασικές αρχές οργάνωσης και λειτουργίας του συνεργείου οχημάτων  Κατανοούν τον τρόπο λειτουργίας και οργάνωσης του χώρου εργασίας, εξοπλισμού και εργαζομένων σε συνεργείο οχημάτων  Τηρούν τους κανονισμούς για την ασφάλεια και υγιεινή στην εργασία.  Γνωρίζουν τις τεχνικές οδηγίες του κατασκευαστή για την διεκπεραίωση εργασιών εντός του προβλεπόμενου χρόνου  Τηρούν τους κανόνες προστασίας του περιβάλλοντος.\n\n**Περιεχόμενο:** Θεωρία: Βασική διάταξη χώρου και εξοπλισμού, φιλοσοφία και τρόπος λειτουργίας συνεργείου. Προϋποθέσεις για ασφαλή εγκατάσταση και χρήση του εξοπλισμού στο συνεργείο.",
    "credits": 3,
    "periods_per_week": 3.0,
    "hours_per_week": 3.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 20
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 40
      }
    ]
  },
  {
    "course_code": "AUT0104",
    "course_name": "Εισαγωγή στη Μηχανολογία Αυτοκινήτων",
    "semester": "Α' Εξάμηνο",
    "description": "**Στόχος:** Οι σπουδαστές με τη διδασκαλία του μαθήματος πρέπει να αποκτήσουν τις απαραίτητες θεωρητικές και πρακτικές γνώσεις και δεξιότητες, έτσι ώστε να μπορούν να εφαρμόζουν τις βασικές αρχές της μηχανολογίας που βρίσκουν εφαρμογή στα αυτοκίνητα .\n\n**Μαθησιακά Αποτελέσματα:** Στο τέλος των μαθημάτων, οι σπουδαστές/τριες θα είναι σε θέση να:  Ορίζουν τις μονάδες μέτρησης με βάση το διεθνές σύστημα μονάδων SI.  Επεξηγούν τη χρήση των εργαλείων του μηχανικού αυτοκινήτων.  Επεξηγούν τη χρήση των μετρητικών οργάνων (μικρόμετρα, παχύμετρα, μαγνητικά μικρόμετρα, κλπ) και μετρούν με επιτυχία διάφορα μεγέθη πάνω σε νεκρές και ζωντανές μηχανές αυτοκινήτου.  Κατονομάζουν και επεξηγούν τους διάφορους τρόπους μετάδοσης κίνησης μεταξύ μηχανισμών που χρησιμοποιούνται στα αυτοκίνητα.  Επιλύουν μηχανολογικά προβλήματα σε θέματα όπως (Κυβισμός, Λόγος συμπίεσης, Λόγος εμβολισμού, Λόγος διωστήρα, Παραγόμενο έργο κινητήρα, Ισχύς κινητήρα)\n\n**Περιεχόμενο:** 1.0 Μονάδες Μέτρησης 1.1 Μονάδες μέτρησης 1.2 Πολλαπλάσια και υποπολλαπλάσια μονάδων μέτρησης 2.0 Όργανα μετρήσεων 2.1 Παχύμετρο 2.2 Μικρόμετρο 2.3 Θερμόμετρο 2.4 Πιεσόμετρα 3.0 Εργαλεία μηχανικού αυτοκινήτων 3.1 Μηχανικά εργαλεία 3.2 Πνευματικά εργαλεία 3.3 Ηλεκτρικά εργαλεία 3.4 Ειδικά εργαλεία 4.0 Υπολογισμοί 4.1 Μηχανικό έργο 4.2 Μηχανική ισχύς 4.3 Ενέργεια 4.4 Βαθμός απόδοσης 4.5 Ροπή στρέψης 4.6 Τριβή 4.7 Πίεση και όγκος αερίων",
    "credits": 6,
    "periods_per_week": 5.0,
    "hours_per_week": 5.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 20
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 40
      }
    ]
  },
  {
    "course_code": "AUT0105",
    "course_name": "Στοιχεία Ηλεκτροτεχνίας & Ηλεκτρονικών Συστημάτων Αυτοκινήτων Ι",
    "semester": "Α' Εξάμηνο",
    "description": "**Στόχος:** Οι σπουδαστές/τριες με τη διδασκαλία του μαθήματος πρέπει να αποκτήσουν τις απαραίτητες θεωρητικές και πρακτικές γνώσεις και δεξιότητες στις βασικές αρχές της Ηλεκτροτεχνίας, να γνωρίζουν τη χρήση και λειτουργία των ηλεκτρικών και ηλεκτρονικών συστημάτων του αυτοκινήτου και να εφαρμόζουν τις πιο πάνω γνώσεις στην επίλυση προβλημάτων επί των συστημάτων αυτών.\n\n**Μαθησιακά Αποτελέσματα:** Στο τέλος των μαθημάτων, οι σπουδαστές/τριες θα είναι σε θέση να:  Ορίζουν και εφαρμόζουν τους νόμους του ηλεκτρικού ρεύματος και των βασικών στοιχείων ηλεκτρονικής.  Ορίζουν τις θεωρίες που διέπουν την ηλεκτρολογία και εφαρμόζουν τις γνώσεις τους στην επίλυση προβλημάτων σε διάφορα ηλεκτρικά κυκλώματα του αυτοκινήτου.  Χρησιμοποιούν με επιτυχία τα μετρητικά όργανα ηλεκτρολογίας αυτοκινήτου στη διάγνωση και επίλυση βασικών προβλημάτων.\n\n**Περιεχόμενο:** 1.0 Θεωρία του Ηλεκτρισμού 1.1 Ηλεκτρονική θεωρία της ύλης 1.2 Αγωγοί, Μονωτές, και Ημιαγωγοί",
    "credits": 3,
    "periods_per_week": 3.0,
    "hours_per_week": 3.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 20
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 40
      }
    ]
  },
  {
    "course_code": "AUT0106",
    "course_name": "Κατασκευαστικό/Ηλεκτρολογικό Σχέδιο Αυτοκινήτων Ι",
    "semester": "Α' Εξάμηνο",
    "description": "**Στόχος:** Σκοπός του μαθήματος είναι να δώσει στους σπουδαστές τις βασικές γνώσεις και δεξιότητες τεχνικού και μηχανολογικού σχεδίου, που να τους καταστήσουν ικανούς στη σχεδίαση απλών εξαρτημάτων. Επίσης, στοχεύει να βοηθήσει στην ανάγνωση του σχεδίου, στην αναγνώριση των διάφορων στοιχείων μηχανών σε σχέδια και σε τεχνικά εγχειρίδια κατασκευαστών και στην αναγνώριση βασικών συμβολισμών σε σχέδια μηχανών, οχημάτων και συστημάτων τους.\n\n**Μαθησιακά Αποτελέσματα:** Μετά την ολοκλήρωση του μαθήματος, οι σπουδαστές θα μπορούν: 1. Να ορίζουν τις βασικές αρχές σχεδίασης, τις κλίμακες σχεδίασης και να διακρίνουν τα διάφορα τυποποιημένα μεγέθη φύλλων σχεδίασης. 2. Να αναγνωρίζουν τη σημασία της τυποποίησης στο σχέδιο. 3. Να σχεδιάζουν απλά αντικείμενα σε τομή, ορθογραφική και ισομετρική προβολή και να τοποθετούν σε αυτά διαστάσεις. 4. Να αναγνωρίζουν σε σχέδιο τους βασικούς συμβολισμούς στοιχείων μηχανών, συνδέσεων, ανοχών και συνεργαζόμενων στοιχείων μηχανών. 5. Να επιδεικνύουν ικανότητα στην ανάγνωση σχεδίων, συναρμολογημένων μηχανισμών με κατάλογο εξαρτημάτων. 6. Να ορίζουν τις δυνατότητες του Η/Υ ως σύγχρονου σχεδιαστικού μέσου και να κάνουν απλές εισαγωγικές σχεδιαστικές εφαρμογές με τη χρήση του.\n\n**Περιεχόμενο:** I Εισαγωγή - Σκοπός του Σχεδίου - Το Σχέδιο ως διεθνής γλώσσα γραφικής επικοινωνίας.  Όργανα και υλικά σχεδίασης.",
    "credits": 4,
    "periods_per_week": 4.0,
    "hours_per_week": 4.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 20
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική",
        "weight": 40
      }
    ]
  },
  {
    "course_code": "AUT0107",
    "course_name": "Συστήματα Παραγωγής Ισχύος Αυτοκινήτων I",
    "semester": "Α' Εξάμηνο",
    "description": "**Στόχος:** Βασικός στόχος αυτού του μαθήματος είναι να προσφέρει στους σπουδαστές γνώσεις, δεξιότητες και ικανότητες στη λειτουργία, διάγνωση βλαβών και επισκευή συμβατικών αλλά και εξελιγμένων Συστημάτων Παραγωγής Ισχύος Αυτοκινήτων.\n\n**Μαθησιακά Αποτελέσματα:** Στο τέλος των μαθημάτων, οι σπουδαστές θα είναι σε θέση να: 1 Επεξηγούν τη λειτουργία όλων των μερών και συστημάτων, πραγματοποιούν ελέγχους και ρυθμίσεις σε τετράχρονές βενζινομηχανές Otto 2 Επεξηγούν τη λειτουργία όλων των μερών και συστημάτων, πραγματοποιούν ελέγχους και ρυθμίσεις σε τετράχρονές πετρελαιομηχανές Diesel",
    "credits": 6,
    "periods_per_week": 5.0,
    "hours_per_week": 5.0,
    "evaluation_rules": [
      {
        "category": "Αξιολόγηση Εργαστηρίου (παρατήρηση εκτέλεσης εργαστηριακής εργασίας και αξιολόγηση γραπτής έκθεσης εργαστηριακών ασκήσεων)",
        "weight": 20
      },
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 10
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 30
      }
    ]
  },
  {
    "course_code": "AUT0201",
    "course_name": "Αγγλικά ΙΙ",
    "semester": "Β' Εξάμηνο",
    "description": "**Στόχος:** Οι σπουδαστές/στριες, να καταστούν ικανοί/ές να επικοινωνούν με άνεση στην αγγλική γλώσσα με πελάτες προσωπικό και συνεργάτες αλλά και κατά τη χρήση διαγνωστικών εργαλείων του συνεργείου.\n\n**Μαθησιακά Αποτελέσματα:** Οι σπουδαστές/στριες, μέσα από τη διδασκαλία του μαθήματος, να αποκτήσουν τις απαραίτητες επιστημονικές γνώσεις και δεξιότητες, έτσι ώστε να καταστούν ικανοί/ές να :  Παρέχουν ικανοποιητική και αποτελεσματική πληροφόρηση σε πελάτες και προσωπικό στην αγγλική γλώσσα.  Τηρούν τις τεχνικές οδηγίες των μηχανημάτων και των εγκαταστάσεων που χειρίζονται, χρησιμοποιώντας εγχειρίδια στην ελληνική και την αγγλική γλώσσα. Οι σπουδαστές/στριες, μέσα από τη διδασκαλία του μαθήματος, να αποκτήσουν τις απαραίτητες επιστημονικές γνώσεις και δεξιότητες, έτσι ώστε να καταστούν ικανοί/ές να \n\n**Περιεχόμενο:** Reading Comprehension: Extract information from text (technical manuals, or articles in technology related journals and magazines). Paraphrasing: What is paraphrasing, when to use it and techniques on how to paraphrase a text. Quoting and referring to sources. Use from articles in technology related journals. Summarizing: Techniques on how to summarize a text. Use examples from technical manuals, or text from articles from technology related journals.",
    "credits": 3,
    "periods_per_week": 2.0,
    "hours_per_week": 2.0,
    "evaluation_rules": [
      {
        "category": "Αξιολόγηση Εργαστηρίου (παρατήρηση εκτέλεσης εργαστηριακής εργασίας και αξιολόγηση γραπτής έκθεσης εργαστηριακών ασκήσεων)",
        "weight": 40
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι και Ενδιάμεση Εξέταση)",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 30
      }
    ]
  },
  {
    "course_code": "AUT0202",
    "course_name": "Συστήματα Παραγωγής Ισχύος Αυτοκινήτων II",
    "semester": "Β' Εξάμηνο",
    "description": "**Στόχος:** Βασικός στόχος αυτού του μαθήματος είναι να προσφέρει στους σπουδαστές γνώσεις, δεξιότητες και ικανότητες στη λειτουργία, διάγνωση βλαβών και επισκευή συμβατικών αλλά και εξελιγμένων Συστημάτων Παραγωγής Ισχύος Αυτοκινήτων.\n\n**Μαθησιακά Αποτελέσματα:** Στο τέλος των μαθημάτων, οι σπουδαστές θα είναι σε θέση να: 3 Επεξηγούν τη λειτουργία των συστημάτων υπερπλήρωσης και πραγματοποιούν ελέγχους ρυθμίσεις και επισκευές. 4 Επεξηγούν τη λειτουργία των συστημάτων ελέγχου εκπομπής καυσαερίων (ρίπων) βενζινομηχανής και πετρελαιομηχανής και πραγματοποιούν ελέγχους ρυθμίσεις και επισκευές.\n\n**Περιεχόμενο:** 1. Συστήματα υπερπλήρωσης 1.1. Εισαγωγή - Τύποι υπερσυμπιεστών 1.2. Yυπερσυμπιεστές μεταβλητής γεωμετρίας 1.3. Συστήματα ψύξης του εισερχόμενου αέρα 1.4. Συστήματα έλεγχου υπερπλήρωσης 1.5. Έλεγχος, ρυθμίσεις, βλάβες 2. Συστήματα ελέγχου εκπομπής καυσαερίων (ρίπων) βενζινομηχανής και πετρελαιομηχανής 2.1. Κατασκευή και λειτουργία του αισθητήρα λάμδα – «λ» 2.2. Κυκλώματα λειτουργίας του αισθητήρα λ 2.3. Καταλυτικοί μετατροπείς 2.4. Λειτουργία του καταλυτικού μετατροπέα – Χημικές αντιδράσεις 2.4.1. Οξειδωτικές αντιδράσεις",
    "credits": 3,
    "periods_per_week": 3.0,
    "hours_per_week": 3.0,
    "evaluation_rules": [
      {
        "category": "Αξιολόγηση Εργαστηρίου (παρατήρηση εκτέλεσης εργαστηριακής εργασίας και αξιολόγηση γραπτής έκθεσης εργαστηριακών ασκήσεων)",
        "weight": 100
      }
    ]
  },
  {
    "course_code": "AUT0203",
    "course_name": "Συστήματα Μετάδοσης της Κίνησης",
    "semester": "Β' Εξάμηνο",
    "description": "**Στόχος:** Οι σπουδαστές/τριες να αποκτήσουν τις απαραίτητες θεωρητικές και πρακτικές γνώσεις και δεξιότητες για τη λειτουργία των συστημάτων μετάδοσης της κίνησης των αυτοκινήτων και να εκτελούν εργασίες συντήρησης και επισκευής επί των συστημάτων αυτών.\n\n**Μαθησιακά Αποτελέσματα:** Στο τέλος των μαθημάτων, οι σπουδαστές/τριες θα είναι σε θέση να:  Επεξηγούν τον τρόπο λειτουργίας του μηχανικού και αυτόματου κιβωτίου ταχυτήτων.  Επεξηγούν τον τρόπο μετάδοσης της κίνησης από τον κινητήρα στο κιβώτιο ταχυτήτων μέσω τον διάφορων ειδών συμπλεκτών.  Επεξηγούν τον τρόπο μετάδοσης της κίνηση από το κιβώτιο ταχυτήτων στους κινητήριους τροχούς  Εφαρμόζουν τις γνώσεις του απέκτησαν με στόχο τη διάγνωση βλαβών στο σύστημα μετάδοσης της κίνησης.  Εφαρμόζουν τις γνώσεις του απέκτησαν με στόχο τη συντήρηση και επισκευή του συστήματος μετάδοσης της κίνησης.\n\n**Περιεχόμενο:** 1.0 Εισαγωγή στο Σύστημα Μετάδοσης της Κίνησης 1.1 Κίνηση μπροστά (πλεονεκτήματα – μειονεκτήματα) 1.2 Κίνηση πίσω (πλεονεκτήματα – μειονεκτήματα) 1.3 Διάταξη των συστημάτων μετάδοσης της κίνησης 2.0 Συμπλέκτες 2.1 Αρχή λειτουργίας των συμπλεκτών 2.2 Μηχανικοί συμπλέκτες τριβής 2.3 Υδραυλικοί συμπλέκτες 2.4 Μετατροπέας Ροπής 3.0 Μηχανικό Κιβώτιο Ταχυτήτων 3.1 Γενικά περί Μηχανικού Κιβωτίου Ταχυτήτων 3.2 Υπολογισμός σχέσης μετάδοσης – Λόγος Ταχύτητας – Ροπή – Ισχύς 3.3 Λειτουργία κιβωτίου ταχυτήτων μόνιμης εμπλοκής με σύστημα συγχρονισμού 3.4 Βλάβες – Φθορές – Συντήρηση – Επισκευή 4.0 Αυτόματο Κιβώτιο Ταχυτήτων 4.1 Γενικά περί Αυτόματου Κιβωτίου Ταχυτήτων 4.2 Πλανητικό σύστημα 4.3 Λειτουργία πλανητικού συστήματος 4.4 Έλεγχος της στεφάνης του πλανητικού συστήματος 4.5 Αυτόματη μετάδοση 4.6 Μηχανισμός σύμπλεξης των σχέσεων μετάδοσης 4.7 Αρχή ελέγχου των σχέσεων ενός πλανητικού συστήματος 4.8 Υδραυλική μονάδα (valve body)",
    "credits": 6,
    "periods_per_week": 5.0,
    "hours_per_week": 5.0,
    "evaluation_rules": [
      {
        "category": "Αξιολόγηση Εργαστηρίου (παρατήρηση εκτέλεσης εργαστηριακής εργασίας και αξιολόγηση γραπτής έκθεσης εργαστηριακών ασκήσεων)",
        "weight": 40
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι και Ενδιάμεση Εξέταση)",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 30
      }
    ]
  },
  {
    "course_code": "AUT0204",
    "course_name": "Περιοδική Συντήρηση Αυτοκινήτου",
    "semester": "Β' Εξάμηνο",
    "description": "**Στόχος:** Στόχος του μαθήματος είναι οι απόφοιτοι να είναι σε θέση να: • Χρησιμοποιούν με άνεση τον κατάλογο του κατασκευαστή (σε έντυπη και ηλεκτρονική μορφή) αντλώντας οδηγίες για περιοδική συντήρηση οχημάτων • Εφαρμόζουν προγράμματα περιοδικής συντήρηση οχημάτων • Εφαρμόζουν (διαφορετικά) προγράμματα συντήρησης με βάση τις οδηγίες του κατασκευαστή. • Επιλέγουν και χειρίζονται με άνεση κατάλληλα εργαλεία, όργανα και συσκευές για περιοδική συντήρηση οχημάτων\n\n**Μαθησιακά Αποτελέσματα:** Οι σπουδαστές με τη διδασκαλία του μαθήματος θα έχουν αποκτήσει τις απαραίτητες γνώσεις και δεξιότητες, ώστε να μπορούν να εκτελούν προγράμματα περιοδικής συντήρησης οχημάτων, επιλέγοντας και χρησιμοποιώντας τα κατάλληλα εργαλεία, όργανα και συσκευές, με βάση τις οδηγίες του κατασκευαστή.\n\n**Περιεχόμενο:** I Μέτρα ασφάλειας και υγιεινής II Τύποι συντηρήσεων: • Προπώλησης",
    "periods_per_week": 5.0,
    "hours_per_week": 5.0,
    "evaluation_rules": [
      {
        "category": "Αξιολόγηση Εργαστηρίου (παρατήρηση εκτέλεσης εργαστηριακής εργασίας και αξιολόγηση γραπτής έκθεσης εργαστηριακών ασκήσεων)",
        "weight": 40
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι και Ενδιάμεση Εξέταση)",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 30
      }
    ]
  },
  {
    "course_code": "AUT0205",
    "course_name": "Ηλεκτρολογικό Σχέδιο Αυτοκινήτων ΙΙ",
    "semester": "Β' Εξάμηνο",
    "description": "**Στόχος:** Σκοπός του μαθήματος είναι να βοηθήσει τους σπουδαστές/τριες να αποκτήσουν τις απαραίτητες γνώσεις και δεξιότητες που να μπορούν να αναγνωρίζουν και να ερμηνεύουν το περιεχόμενο ηλεκτρολογικών σχεδίων των αυτοκινήτων και να σχεδιάζουν απλά και σύνθετα ηλεκτρικά κυκλώματα των αυτοκινήτων.\n\n**Μαθησιακά Αποτελέσματα:** Μετά την ολοκλήρωση του μαθήματος, οι σπουδαστές/τριες θα πρέπει να μπορούν:  Να αναγνωρίζουν και να ερμηνεύουν ηλεκτρολογικά/ηλεκτρονικά σχέδια του αυτοκινήτου  Να ορίζουν και να εφαρμόζουν τις βασικές αρχές σχεδίασης απλών ηλεκτρικών/ ηλεκτρονικών κυκλωμάτων του αυτοκινήτου  Να χρησιμοποιούν τις τεχνικές οδηγίες και εγχειρίδια συντήρησης.\n\n**Περιεχόμενο:** 1. Ηλεκτρολογικό Σχέδιο Μηχανοκινήτων Οχημάτων 1.1. Εισαγωγή – Ορισμοί 1.2. Κωδικοποιημένα σύμβολα των πιο κάτω στοιχείων, οργάνων, συσκευών και μηχανισμών ηλεκτρολογικών και ηλεκτρονικών κυκλωμάτων του αυτοκινήτου, σύμφωνα με προδιαγραφές DIN.  Αγωγοί – καλώδια  Ακροδέκτες  Διακόπτες  Δείκτες μηχανικών λειτουργιών",
    "credits": 3,
    "periods_per_week": 3.0,
    "hours_per_week": 3.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 10
      },
      {
        "category": "Αξιολόγηση εργαστηριακών μετρήσεων, εκτέλεση εργαστηριακής εργασίας και αξιολόγηση γραπτής έκθεσης εργαστηριακών ασκήσεων",
        "weight": 20
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 30
      }
    ]
  },
  {
    "course_code": "AUT0206",
    "course_name": "Στοιχεία Ηλεκτροτεχνίας & Ηλεκτρονικών Συστημάτων Αυτοκινήτων ΙΙ",
    "semester": "Β' Εξάμηνο",
    "description": "**Στόχος:** Οι σπουδαστές, με τη διδασκαλία του μαθήματος, πρέπει να αποκτήσουν τις απαραίτητες θεωρητικές και πρακτικές γνώσεις και δεξιότητες στις βασικές αρχές λειτουργίας στα συστήματα φωτισμού, τον συσσωρευτή καθώς και το σύστημα εκκίνησης και ανάφλεξης του αυτοκινήτου.\n\n**Μαθησιακά Αποτελέσματα:** Στο τέλος των μαθημάτων, οι σπουδαστές θα είναι σε θέση να:  Χρησιμοποιούν με επιτυχία τα μετρητικά όργανα ηλεκτρολογίας αυτοκινήτου στη διάγνωση και επίλυση προβλημάτων των ηλεκτρικών και ηλεκτρονικών συστημάτων του αυτοκινήτου  Επεξηγούν τη λειτουργία των ηλεκτρικών συστημάτων φωτισμού, εκκίνησης και ανάφλεξης του αυτοκινήτου και εφαρμόζουν τις γνώσεις στην επίλυση προβλημάτων που παρουσιάζονται σε αυτά.  Επιλέγουν και χρησιμοποιούν τα κατάλληλα όργανα και εργαλεία για την συντήρηση, διάγνωση και επισκευή συστημάτων φωτισμού, εκκίνησης και ανάφλεξης του αυτοκινήτου.\n\n**Περιεχόμενο:** 1.0 Σύστημα Φωτισμού 1.1 Λυχνίες",
    "credits": 4,
    "periods_per_week": 4.0,
    "hours_per_week": 4.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 10
      },
      {
        "category": "Αξιολόγηση εργαστηριακών μετρήσεων, εκτέλεση εργαστηριακής εργασίας και αξιολόγηση γραπτής έκθεσης εργαστηριακών ασκήσεων",
        "weight": 20
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 30
      }
    ]
  },
  {
    "course_code": "AUT0207",
    "course_name": "Δυναμική Οχημάτων",
    "semester": "Β' Εξάμηνο",
    "description": "**Στόχος:** Οι σπουδαστές με τη διδασκαλία του μαθήματος πρέπει να αποκτήσουν τις απαραίτητες θεωρητικές γνώσεις, έτσι ώστε να μπορούν να υπολογίζουν τις δυνάμεις και ροπές που ασκούνται σε ένα στατικό και εν κίνηση όχημα.\n\n**Μαθησιακά Αποτελέσματα:** Στο τέλος των μαθημάτων, οι σπουδαστές θα είναι σε θέση να:  ορίζουν και υπολογίζουν τις δυνάμεις και ροπές που ασκούνται σε ένα όχημα  υπολογίζουν τις δυνάμεις αντίστασης που εφαρμόζονται σε ένα όχημα την ώρα της κίνησης του  υπολογίζουν τη ροπή φρεναρίσματος  εξηγούν την ισχύ και τη ροπή του κινητήρα με τη χρήση διαγράμματος  υπολογίζουν την αεροδυναμική αντίσταση και πως αυτή επηρεάζεται από τον τύπο του αμαξώματος.\n\n**Περιεχόμενο:** 1.1 Κέντρο βάρους οχήματος 1.2 Δυνάμεις και ροπές που ασκούνται στο κέντρο βάρους 1.3 Δυνάμεις και ροπές που ασκούνται στους τροχούς 2.0 Δυνάμεις Αντίστασης σε Κινούμενο Όχημα 2.1Συντελεστής τριβής κύλισης 2.2 Τριβή κύλισης 2.3 Αεροδυναμική 2.4 Αντίσταση κλίσης του δρόμου 2.5 Επιτάχυνση του οχήματος 3.0 Δυναμική Οχημάτων 3.1 Στην ευθεία 3.2 Σε καμπύλη τροχιά 3.3 Σε κεκλιμένη επιφάνεια 4.0 Δυναμική της Πέδησης 4.1 Ροπή φρεναρίσματος δισκόφρενου 4.2 Ροπή φρεναρίσματος ταμπουρόφρενων 4.3 Δύναμη φρεναρίσματος 5.0 Αεροδυναμική Αυτοκινήτων 5.1 Αεροδυναμικός συντελεστής 5.2 Υπολογισμός αεροδυναμικής αντίστασης 5.3 Κατανομή αεροδυναμικών πιέσεων στο αμάξωμα του αυτοκινήτου ανάλογα με τον τύπο του αμαξώματος 5.4 Αεροδυναμικά βοηθήματα",
    "credits": 2,
    "periods_per_week": 2.0,
    "hours_per_week": 2.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 20
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 40
      }
    ]
  },
  {
    "course_code": "AUT0208",
    "course_name": "ΠΡΑΚΤΙΚΗ ΚΑΤΑΡΤΙΣΗ Ι",
    "semester": "Β' Εξάμηνο",
    "description": "**Στόχος:** Στόχος Μαθήματος H πρακτική άσκηση αποσκοπεί στην αρχική επαγγελματική κατάρτιση των σπουδαστών σε βασικές θέσεις εργασίας στον κλάδο της μηχανικής οχημάτων. Οι σπουδαστές θα αποκτήσουν σχετική εμπειρία και επιπρόσθετες γνώσεις και δεξιότητες συναφείς με το επάγγελμα. Επίσης, η πρακτική άσκηση θα δώσει στους σπουδαστές την ευκαιρία να εφαρμόσουν τις θεωρίες της τάξης στην πράξη εκτελώντας βασικά καθήκοντα και ευθύνες στον επιλεγμένο χώρο εργασίας. Τέλος, οι σπουδαστές θα είναι σε θέση να εξερευνήσουν τις προοπτικές της επαγγελματικής τους σταδιοδρομίας, να εξοικειωθούν με τις απαιτήσεις της βιομηχανίας για άμεση εργοδότηση καθώς επίσης και να ξεκινήσουν το δικό τους επαγγελματικό δίκτυο.\n\n**Μαθησιακά Αποτελέσματα:** Οι σπουδαστές/στριες θα είναι σε θέση να: • Αποκτήσουν βιομηχανική εμπειρία, • Αναπτύξουν βασικές επαγγελματικές ικανότητες, • Κατανοούν τη φύση, τις ευκαιρίες και τις απαιτήσεις του επαγγέλματος και της βιομηχανίας, • Δημιουργούν επαφές και σχέσεις με σημαντικούς επαγγελματίες του κλάδου. • Εκκινήσουν και θέσουν τις βάσεις για την εξέλιξη της επαγγελματικής τους σταδιοδρομία.\n\n**Περιεχόμενο:** Οι σπουδαστές θα ενεργοποιηθούν σε ένα από τους πιο κάτω τομείς: • Συνεργεία που υπάγονται σε αντιπροσωπίες οχημάτων, • Ανεξάρτητα συνεργεία, • Συνεργεία μεγάλων εταιρειών,"
  },
  {
    "course_code": "AUT0301",
    "course_name": "Αισθητήρες & Ενεργοποιητές - Δομή & Λειτουργία των Μονάδων Ελέγχου Αυτοκινήτων",
    "semester": "Γ' Εξάμηνο",
    "description": "**Στόχος:** Η απόκτηση γνώσεων και δεξιοτήτων στην δομή, λειτουργία, διάγνωση και επιδιόρθωση στα συστήματα ελέγχου αυτόματων λειτουργιών στα διάφορα συστήματα και μηχανισμούς των αυτοκινήτων.\n\n**Μαθησιακά Αποτελέσματα:** Με την ολοκλήρωση του μαθήματος, οι σπουδαστές/τριες θα πρέπει να: 1. Ορίζουν και να επεξηγούν τη δομή και λειτουργία των διαφόρων συστημάτων και των μερών τους 2. Επιλέγουν, χρησιμοποιούν με επάρκεια σχετικούς καταλόγους πληροφοριών στα ελληνικά και στα αγγλικά σε ηλεκτρονική ή/και έντυπη μορφή. 3. Επιλέγουν και χρησιμοποιούν εργαλεία, όργανα και συσκευές, εκτελούν μετρήσεις, ελέγχους και διάγνωση, στα διάφορα συστήματα των αυτοκινήτων. 4. Επιλέγουν και χρησιμοποιούν εργαλεία, όργανα και συσκευές για την εκτέλεση ρυθμίσεων, επιδιορθώσεων και επαναπρογραμματιμού οπού αυτό είναι απαραίτητο, στα διάφορα συστήματα των αυτοκινήτων. Προαπαιτούμενα AUT 0105 Συναπαιτούμενα Δεν ισχύει\n\n**Περιεχόμενο:** Περιεχόμενο 1 Δομή των συστημάτων ελέγχου αυτόματων λειτουργιών • Ανοικτού τύπου • Κλειστού τύπου Μαθήματος",
    "credits": 6,
    "periods_per_week": 5.0,
    "hours_per_week": 5.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 10
      },
      {
        "category": "Αξιολόγηση εργαστηριακών μετρήσεων, εκτέλεση εργαστηριακής εργασίας και αξιολόγηση γραπτής έκθεσης εργαστηριακών ασκήσεων",
        "weight": 20
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 30
      }
    ]
  },
  {
    "course_code": "AUT0302",
    "course_name": "Συστήματα Πέδησης, Ανάρτησης και Διεύθυνσης Αυτοκινήτου",
    "semester": "Γ' Εξάμηνο",
    "description": "**Στόχος:** Στόχος Μαθήματος Ο σκοπός του μαθήματος είναι να δώσει στους σπουδαστές βασικές γνώσεις και θεωρητικές αρχές λειτουργίας των συστημάτων πέδησης, ανάρτησης και διεύθυνσης του αυτοκινήτου, καθώς και των εξαρτημάτων των αναφερόμενων συστημάτων. Επίσης να βοηθήσει τους σπουδαστές να αποκτήσουν γενικές τεχνολογικές γνώσεις και πρακτικές δεξιότητες αναφορικά με τους τροχούς - ελαστικά και πλαίσιο - αμάξωμα. Το μάθημα στοχεύει επίσης να δώσει στους σπουδαστές δεξιότητες ελέγχου, και συντήρησης μέσω των εργαστηριακών μαθημάτων.\n\n**Μαθησιακά Αποτελέσματα:** Μετά την ολοκλήρωση του μαθήματος, οι σπουδαστές θα πρέπει να μπορούν: 1. Να επεξηγούν τον προορισμό, τις αρχές λειτουργίας και την διάταξη των μερών των συστημάτων: πέδησης, ανάρτησης και διεύθυνσης. 2. Να ταξινόμηση τους διάφορους τύπους τροχών και ελαστικών και να είναι σε θέση να προβαίνουν σε διάφορες εργασίες συντήρησης ή και αντικατάστασής τους. 3. Να επεξηγούν τα βασικά μέρη και τρόπους κατασκευής του πλαισίου και του αμαξώματος και να εκτελούν βασικές εργασίες συντήρησης. 4. Να εκτελούν βασικές μετρήσεις (Chassis Mechanical Measurements) στο πλαίσιο του αμαξώματος. 5. Να εφαρμόζουν ελέγχους/μετρήσεις/διάγνωση, να συντηρούν και να επιδιορθώνουν με βάση τις οδηγίες του κατασκευαστή τα σύγχρονα συστήματα: πέδησης, ανάρτησης και διεύθυνσης.\n\n**Περιεχόμενο:** I Εισαγωγή στο Μάθημα - Σκοπός του Μαθήματος - Ορισμοί. II Μέτρα ασφάλειας, προστασίας, υγιεινής και εργονομίας στην ειδική αίθουσα και στα εργαστήρια μηχανικής αυτοκινήτων. III Σύστημα Πέδησης - Σύγχρονα Συστήματα Πέδησης. • Κατασκευή, λειτουργία, συντήρηση, διάγνωση και επιδιόρθωση. IV Σύστημα Ανάρτησης - Σύγχρονα Συστήματα Ανάρτησης.  Κατασκευή, λειτουργία, συντήρηση, διάγνωση και επιδιόρθωση. V Σύστημα Διεύθυνσης - Σύγχρονα Συστήματα Διεύθυνσης.  Κατασκευή, λειτουργία, συντήρηση, διάγνωση και επιδιόρθωση.  Γεωμετρία του συστήματος διεύθυνσης. VI Τροχοί - Ελαστικά. VII Πλαίσιο – Αμάξωμα  Κατασκευή του πλαισίου και του αμαξώματος  Γεωμετρία του πλαισίου.",
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 10
      },
      {
        "category": "Αξιολόγηση εργαστηριακών μετρήσεων, εκτέλεση εργαστηριακής εργασίας και αξιολόγηση γραπτής έκθεσης εργαστηριακών ασκήσεων",
        "weight": 20
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 30
      }
    ]
  },
  {
    "course_code": "AUT0303",
    "course_name": "Συστήματα ασφάλειας επιβατών και οχημάτων & άνεσης επιβατών",
    "semester": "Γ' Εξάμηνο",
    "description": "**Στόχος:** Στόχος του μαθήματος είναι οι σπουδαστές να αποκτήσουν βασικές γνώσεις και θεωρητικές αρχές λειτουργίας των συστημάτων Ενεργητικής και Παθητικής Ασφάλειας. Επίσης να βοηθήσει τους σπουδαστές να αποκτήσουν γενικές τεχνολογικές γνώσεις αναφορικά με τα συστήματα Άνεσης και Ασφάλειας του αυτοκινήτου. Το μάθημα στοχεύει επίσης να δώσει στους σπουδαστές δεξιότητες ελέγχου, και συντήρησης μέσω των εργαστηριακών μαθημάτων.\n\n**Μαθησιακά Αποτελέσματα:** Μετά την ολοκλήρωση του μαθήματος, οι σπουδαστές/τριες θα πρέπει να μπορούν: 1. Να ορίζουν και επεξηγούν τον προορισμό, τις αρχές λειτουργίας και την διάταξη των μερών των συστημάτων που περιλαμβάνονται στα συστήματα Ενεργητικής και Παθητικής Ασφάλειας 2. Να εφαρμόζουν διαγνωστικούς ελέγχους, να συντηρούν και να επιδιορθώνουν με βάση τις οδηγίες του κατασκευαστή, τα σύγχρονα συστήματα Ενεργητικής και Παθητικής Ασφάλειας 3. Να ορίζουν και επεξηγούν τον προορισμό, τις αρχές λειτουργίας και την διάταξη των μερών των συστημάτων άνεσης επιβατών. 4. Να εφαρμόζουν διαγνωστικούς ελέγχους, να συντηρούν και να επιδιορθώνουν με βάση τις οδηγίες του κατασκευαστή, τα σύγχρονα συστήματα άνεσης επιβατών.\n\n**Περιεχόμενο:** 1. Συστήματα Ενεργητικής και Παθητικής Ασφάλειας 1.1 Συστήματα Παθητικής Ασφάλειας",
    "credits": 6,
    "periods_per_week": 5.0,
    "hours_per_week": 5.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 14
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 14
      },
      {
        "category": "Αξιολόγηση εργαστηριακών μετρήσεων, εκτέλεση εργαστηριακής εργασίας και αξιολόγηση γραπτής έκθεσης εργαστηριακών ασκήσεων",
        "weight": 29
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 43
      }
    ]
  },
  {
    "course_code": "AUT0304",
    "course_name": "Τεχνολογία Υβριδικών και Ηλεκτροκίνητων Αυτοκινήτων Ι",
    "semester": "Γ' Εξάμηνο",
    "description": "**Στόχος:** Οι σπουδαστές με τη διδασκαλία του μαθήματος θα έχουν αποκτήσει τις απαραίτητες επιστημονικές γνώσεις και δεξιότητες, έτσι ώστε να μπορούν να συντηρήσουν τα υβριδικά και ηλεκτρικά οχήματα. Οι σπουδαστές επίσης θα έχουν τη δυνατότητα να αναπτύξουν τις μεθοδολογίες ελέγχου των εν λόγω οχημάτων.\n\n**Μαθησιακά Αποτελέσματα:** Στο τέλος των μαθημάτων, οι σπουδαστές θα είναι σε θέση:  Να κατονομάζουν και ταξινομούν τις βασικές αρχές καθώς και τον τρόπο λειτουργίας των διαφόρων τύπων υβριδικών και ηλεκτρικών οχημάτων.  Να κατονομάζουν και εφαρμόζουν μέτρα ασφάλεια και υγείας κατά την εργασία στα υβριδικά και ηλεκτρικά οχήματα.  Να αξιολογούν τους κίνδυνους και να εφαρμόζουν τρόπους αντιμετώπισής τους σε διάφορα σενάρια στα υβριδικά και ηλεκτρικά οχήματα.  Να επεξηγούν τις αρχές λειτουργίας των μερών των υβριδικών και ηλεκτρικών οχημάτων.  Να επιλέγουν τον ορθό τρόπο σύνδεσης και αποσύνδεσης ηλεκτρικών εξαρτημάτων σε υβριδικά και ηλεκτρικά οχήματα.\n\n**Περιεχόμενο:** Θεωρία:  Εισαγωγή στην Υβριδική Τεχνολογία  Ιστορική Εξέλιξη Υβριδικών Οχημάτων  Χαρακτηριστικά Υβριδικών Οχημάτων  Τύποι Υβριδικών Συστημάτων  Τεχνικά Χαρακτηριστικά Υβριδικών Οχημάτων  Μέρη Υβριδικού Οχήματος o Ηλεκτρικοί κινητήρες o Συστήματα μετάδοσης o Συσσωρευτές o Σύστημα διαχείρισης ενέργειας  Μέτρα ασφάλειας και κανόνες εργασίας στα Υβριδικά Οχήματα  Περιοδική συντήρηση  Χειρισμός Υβριδικών Οχημάτων σε περίπτωση ατυχήματος Εργαστήριο:  Λειτουργία του Υβριδικού Οχήματος  Διάταξη και λειτουργία των μερών Υβριδικών Οχημάτων  Σύνδεση και αποσύνδεση του συσσωρευτή Υβριδικού Οχήματος  Περιοδική συντήρηση με βάση τις οδηγίες του κατασκευαστή Διαλέξεις με χρήση Πολυμέσων, Συζητήσεις, Περιπτωσιακές Μελέτες, πρακτική εξάσκηση στο εργαστήριο",
    "credits": 3,
    "periods_per_week": 3.0,
    "hours_per_week": 3.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 10
      },
      {
        "category": "Αξιολόγηση εργαστηριακών μετρήσεων, εκτέλεση εργαστηριακής εργασίας",
        "weight": 20
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 30
      }
    ]
  },
  {
    "course_code": "AUT0305",
    "course_name": "Συστήματα Κλιματισμού Αυτοκινήτων",
    "semester": "Γ' Εξάμηνο",
    "description": "**Στόχος:** Οι σπουδαστές να αποκτήσουν τις απαραίτητες θεωρητικές και πρακτικές γνώσεις για το σύστημα κλιματισμού αυτοκινήτων. Επίσης, να επιλέγουν και να χρησιμοποιούν τα κατάλληλα εργαλεία και μηχανήματα, εφαρμόζοντας τη γνώση που θα αποκτήσουν, για να συντηρούν και επισκευάζουν το σύστημα κλιματισμού αυτοκινήτων με επιτυχία. Πρέπει επίσης να γνωρίζουν τον τρόπο διαχείρισης των ψυκτικών αερίων, βάσει των ευρωπαϊκών και κρατικών οδηγιών.\n\n**Μαθησιακά Αποτελέσματα:** Στο τέλος των μαθημάτων, οι σπουδαστές θα είναι σε θέση να:  Εξηγούν τον κύκλο ψύξης  Εξηγούν τη λειτουργίας του συστήματος  Εξηγούν τη λειτουργία των μηχανικών μερών του συστήματος  Εξηγούν τη λειτουργία των ηλεκτρικών και ηλεκτρονικών μερών του συστήματος  Χειρίζονται τα κατάλληλα μηχανήματα για την ανάκτηση και πλήρωση του ψυκτικού αερίου  Διαχειρίζονται με ασφάλεια τα ψυκτικά αέρια\n\n**Περιεχόμενο:** 1.0 Εισαγωγή στο Μάθημα Τεχνολογία και Εργαστήρια Κλιματισμού Μηχανοκινήτων Οχημάτων 1.1 Χρησιμότητα του κλιματισμού 1.2 Σχεδιασμός συστήματος κλιματισμού 2.0 Βασικός Κύκλος Ψύξης 2.1 Ψυκτική ισχύς 3.0 Περιγραφή Συστήματος Κλιματισμού 3.1 Περιγραφή συστήματος κλιματισμού – αναφορά στις πιέσεις και θερμοκρασίες 3.2 Συμπιεστής 3.3 Παλινδρομικός συμπιεστής 3.4 Περιστροφικός συμπιεστής μεταβλητού όγκου 3.5 Περιστροφικός συμπιεστής μεταβλητού όγκου χωρίς μαγνητικό συμπλέκτη 3.4 Περιστροφικός συμπιεστής σταθερού όγκου με διπλά έμβολα 3.5 Ελικοειδής συμπιεστής (με σπείρες τύπου scroll) 3.6 Περιστροφικός συμπιεστής με πτερύγια 3.7 Ηλεκτροκίνητος συμπιεστής 4.0 Μαγνητικός Συμπλέκτης 4.1 Λειτουργία μαγνητικού συμπλέκτη",
    "credits": 5,
    "periods_per_week": 5.0,
    "hours_per_week": 5.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 10
      },
      {
        "category": "Αξιολόγηση εργαστηριακών μετρήσεων, εκτέλεση εργαστηριακής εργασίας",
        "weight": 20
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 30
      }
    ]
  },
  {
    "course_code": "AUT0401",
    "course_name": "Μη-περιοδική συντήρηση και επισκευή αυτοκινήτου",
    "semester": "Δ' Εξάμηνο",
    "description": "**Στόχος:** Οι σπουδαστές με τη διδασκαλία του μαθήματος θα αποκτήσουν τις απαραίτητες γνώσεις και δεξιότητες, έτσι ώστε να μπορούν να γνωρίζουν τις βασικές αρχές της μη-περιοδικής συντήρησης οχημάτων, να επιλέγουν τα κατάλληλα εργαλεία για να εφαρμόζουν τα προγράμματα συντήρησης του κατασκευαστή.\n\n**Μαθησιακά Αποτελέσματα:** Στόχοι του μαθήματος είναι οι απόφοιτοι να είναι σε θέση να:  Αναγνωρίζουν και περιγράφουν τις βασικές αρχές της μη- περιοδικής συντήρησης οχημάτων.  Εφαρμόζουν τις βασικές αρχές της μη-περιοδικής συντήρησης οχημάτων.  Χειρίζονται χρησιμοποιούν εργαλεία για να εφαρμόζουν βασικές αρχές συντήρησης οχημάτων. Προαπαιτούμενα AUT 0301 Συναπαιτούμενα Δεν ισχύει\n\n**Περιεχόμενο:** Περιεχόμενο Θεωρία: Βασικές γνώσεις συντήρησης. Εισαγωγή στην μη-περιοδική συντήρηση. Συνθήκες οδήγησης και χρήσης οχήματος σε σχέση με τη μη-περιοδική συντήρηση. Σκοπός της μη-περιοδικής συντήρησης. Μη-περιοδική Συντήρηση (Βενζινοκινητήρα & Πετρελαιοκινητήρα) στα ακόλουθα μέρη:  Ιμάντας Χρονισμού  Σύστημα Φόρτισης - Εναλλακτήρας  Σύστημα Τροφοδοσίας - Εγχυτήρες Μαθήματος",
    "credits": 7,
    "periods_per_week": 6.0,
    "hours_per_week": 6.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 10
      },
      {
        "category": "Αξιολόγηση εργαστηριακών μετρήσεων, εκτέλεση εργαστηριακής εργασίας",
        "weight": 20
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 30
      }
    ]
  },
  {
    "course_code": "AUT0402",
    "course_name": "Τεχνολογία Υβριδικών και Ηλεκτροκίνητων Αυτοκινήτων ΙI",
    "semester": "Δ' Εξάμηνο",
    "description": "**Στόχος:** Οι σπουδαστές με τη διδασκαλία του μαθήματος θα έχουν αποκτήσει τις απαραίτητες γνώσεις και δεξιότητες, έτσι ώστε να μπορούν να:  Κατανοούν την λειτουργία των υβριδικών και ηλεκτρικών οχημάτων με: συμβατικό συσσωρευτή, και κυψέλες υδρογόνου.  Εκτελούν με ασφάλεια ελέγχους, διάγνωση και επιδιόρθωση των υβριδικών οχημάτων, τηρώντας σχετικά πρωτόκολλα και διαδικασίες .\n\n**Μαθησιακά Αποτελέσματα:** Στο τέλος των μαθημάτων, οι σπουδαστές θα είναι σε θέση:  Να ορίζουν και να επεξηγούν τις βασικές αρχές περιοδικής συντήρησης των υβριδικών και ηλεκτρικών οχημάτων  Να ορίζουν και να επεξηγούν τις βασικές αρχές διάγνωσης βλαβών στα υβριδικά και ηλεκτρικά οχήματα με συμβατικό συσσωρευτή και κυψέλες υδρογόνου  Να ορίζουν, επεξηγούν και αξιολογούν τις πιθανές βλάβες στο όχημα μέσα από τους κωδικούς διάγνωσης συστημάτων OBD II ή EOBD.\n\n**Περιεχόμενο:** Θεωρία: Ανάλυση μερών υβριδικού κιβωτίου Σύστημα λίπανσης και ψύξης υβριδικού κιβωτίου Ανάλυση και επεξήγηση συστήματος κλιματισμού, υβριδικής μπαταρίας, πέδησης Τρόπος λειτουργίας υβριδικών και ηλεκτρικών οχημάτων",
    "credits": 5,
    "periods_per_week": 5.0,
    "hours_per_week": 5.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 10
      },
      {
        "category": "Αξιολόγηση εργαστηριακών μετρήσεων, εκτέλεση εργαστηριακής εργασίας",
        "weight": 20
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 30
      }
    ]
  },
  {
    "course_code": "AUT0403",
    "course_name": "Διάγνωση Βλαβών Αυτοκινήτων",
    "semester": "Δ' Εξάμηνο",
    "description": "**Στόχος:** O σκοπός του μαθήματος αυτού είναι να δώσει στους σπουδαστές τις βασικές γνώσεις, που αφορούν τους τεχνικούς και διαγνωστικούς ελέγχους που απαιτούνται από την Κυπριακή και Ευρωπαϊκή νομοθεσία, καθώς επίσης και βασικές δεξιότητες εκτέλεσης των τεχνικών και διαγνωστικών αυτών ελέγχων.\n\n**Μαθησιακά Αποτελέσματα:** Με την ολοκλήρωση του μαθήματος, οι σπουδαστές θα μπορούν να:  Εκτελούν διαγνώσεις και αναλύσεις, και προβαίνουν σε επιδιορθώσεις διαφόρων συστημάτων στα οχήματα.  Επιλέγουν και χειρίζονται τα κατάλληλα εργαλεία και συσκευές επιδιόρθωσης, ανάλογα με το είδος του προβλήματος.  Ορίζουν και εφαρμόζουν την Κυπριακή και Ευρωπαϊκή νομοθεσία που σχετίζεται με τον Περί Έγκρισης Τύπου Οχημάτων και με τον τεχνικό και διαγνωστικό έλεγχο των αυτοκινήτων.\n\n**Περιεχόμενο:** 1. Εισαγωγή στο Μάθημα - Σκοπός του Μαθήματος - Ορισμοί 2. Μεθοδολογία Διάγνωσης και Ελέγχου 2.1. Εισαγωγή στη μεθοδολογία της διάγνωσης και του ελέγχου",
    "credits": 6,
    "periods_per_week": 5.0,
    "hours_per_week": 5.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 50
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 50
      }
    ]
  },
  {
    "course_code": "AUT0404",
    "course_name": "Δίκτυα επικοινωνίας συστημάτων αυτοκινήτων",
    "semester": "Δ' Εξάμηνο",
    "description": "**Στόχος:** O σκοπός του μαθήματος αυτού είναι να δώσει στους σπουδαστές τις βασικές γνώσεις και δεξιότητες που αφορούν στα δίκτυα ενδοεπικοινωνίας οχημάτων «MULTIPLEX» ώστε να μπορούν να προβαίνουν σε διαγνώσεις βλαβών και συνεπακόλουθων επισκευών των συστημάτων αυτών.\n\n**Μαθησιακά Αποτελέσματα:** Οι σπουδαστές, με τη διδασκαλία του μαθήματος, θα έχουν αποκτήσει τις απαραίτητες γνώσεις και δεξιότητες, έτσι ώστε να μπορούν να:  Κατανοούν τη λειτουργία και εκτιμούν τα τεχνικά χαρακτηριστικά των συστημάτων ενδοεπικοινωνίας οχημάτων MULTIPLEX.  Περιγράφουν και εφαρμόζουν τις βασικές αρχές διάγνωσης δικτύων ενδοεπικοινωνίας οχημάτων «MULTIPLEX».  Να εκτελούν με επάρκεια, χρησιμοποιώντας κατάλληλα όργανα και συσκευές, ελέγχους, διάγνωση και επιδιόρθωσης στα δίκτυα επικοινωνίας οχημάτων «MULTIPLEX».\n\n**Περιεχόμενο:** Θεωρία: Δίκτυα Επικοινωνίας στα οχήματα (Automotive Networking)  Εισαγωγή στα δίκτυα επικοινωνίας οχημάτων.  Απαιτήσεις συστημάτων επικοινωνίας  Ταξινόμηση δικτύων «MULTIPLEX»  Τοπολογία δικτύων «MULTIPLEX»  Εφαρμογές των δικτύων επικοινωνίας στα οχήματα",
    "credits": 6,
    "periods_per_week": 5.0,
    "hours_per_week": 5.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 10
      },
      {
        "category": "Αξιολόγηση εργαστηριακών μετρήσεων, εκτέλεση εργαστηριακής εργασίας",
        "weight": 20
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 30
      }
    ]
  },
  {
    "course_code": "AUT0405",
    "course_name": "Νομοθεσία και Δεοντολογία Επαγγέλματος",
    "semester": "Δ' Εξάμηνο",
    "description": "**Στόχος:** Βασικός στόχος αυτού του μαθήματος είναι να προσφέρει στους σπουδαστές τις απαραίτητες γνώσεις και δεξιότητες ώστε να εργάζονται μέσα στο πλαίσιο της σχετικής νομοθεσίας, να επιδεικνύουν επαγγελματική και δεοντολογική συμπεριφορά προς συναδέλφους, συνεργάτες και πελάτες σύμφωνα με τις επαγγελματικές αξίες και τους ηθικούς κανόνες.\n\n**Μαθησιακά Αποτελέσματα:** Στο τέλος των μαθημάτων, οι σπουδαστές θα είναι σε θέση να  Εργάζονται μέσα στο πλαίσιο του νόμου περί των Τεχνιτών Οχημάτων του 2006 (Ν. 60(I)/2006).  Εφαρμόζουν αρχές επαγγελματικής και επιχειρηματικής ηθικής όπως το αίσθημα ευθύνης, η ακεραιότητα, η ειλικρίνεια, η συνέπεια και ο σεβασμός.  Πραγματοποιούν συναλλαγές σύμφωνα με τις επαγγελματικές και εταιρικές αξίες και με γνώμονα τους κανόνες του θεμιτού ανταγωνισμού.  Διασφαλίζουν την ποιότητα των παρεχόμενων υπηρεσιών.  Χειρίζονται με ευελιξία και λεπτότητα τις ενδεχόμενες απρόβλεπτες καταστάσεις με πελάτες, συνεργάτες και προϊστάμενους, πάντα στο πλαίσιο της νομοθεσίας και της δεοντολογίας του επαγγέλματος. Προαπαιτούμενα Δεν ισχύει Συναπαιτούμενα Δεν ισχύει\n\n**Περιεχόμενο:**  Νομοθεσία που αφορά την έκδοση άδειας τεχνίτη οχημάτων για όλες τις ειδικότητες.  Νομοθεσία που αφορά τις υποχρεώσεις του αδειούχου τεχνίτη οχημάτων  Τεχνικά πρότυπα, κώδικες πρακτικής ή τεχνικές διαδικασίες, με τα οποία θα πρέπει να συμμορφώνονται οι τεχνίτες οχημάτων σε σχέση με την ανάληψη και διεκπεραίωση συγκεκριμένων τεχνικών εργασιών σχετικών με την άδεια τεχνίτη οχημάτων που κατέχουν  Στοιχεία που περιλαμβάνονται στο φάκελο οχήματος που τηρεί ο αδειούχος τεχνίτης οχημάτων για οχήματα, των οποίων διεκπεραίωσε τη συντήρηση/επιδιόρθωση  Αρχές επαγγελματικής και επιχειρηματικής ηθικής και δεοντολογίας στον επαγγελματικό χώρο της μηχανικής οχημάτων:  Σύγκρουση Συμφερόντων  Εσωτερικές πληροφορίες & Συναλλαγές βάσει αυτών  Ανταγωνισμός και Δίκαιη Συμπεριφορά κατά τις Συναλλαγές  Δωροδοκία και Διαφθορά  Ακεραιότητα / Εντιμότητα  Διακρίσεις και Παρενόχληση  Αναγνώριση και αποφυγή συγκρούσεων  Υγεία και Ασφάλεια  Αλκοόλ και Ναρκωτικά  Περιβαλλοντικά  Ατομικά Αρχεία Εργαζομένων  Θέματα προσωπικών δεδομένων  Δία Βίου Μάθηση  Τήρηση Αρχείων, Οικονομικός Έλεγχος  Εμπιστευτικότητα  Προώθηση του σεβασμού, της ασφάλειας και της προστασίας στο χώρο εργασίας  Αναφορά οποιασδήποτε παράνομης ή Ανήθικης Συμπεριφοράς  Πρόσθετες Υποχρεώσεις Διευθυντών",
    "credits": 3,
    "periods_per_week": 3.0,
    "hours_per_week": 3.0,
    "evaluation_rules": [
      {
        "category": "Συμμετοχή στο Μάθημα",
        "weight": 10
      },
      {
        "category": "Συνεχής Αξιολόγηση (Εκπόνηση εργασιών στο σπίτι)",
        "weight": 10
      },
      {
        "category": "Αξιολόγηση εργαστηριακών μετρήσεων, εκτέλεση εργαστηριακής εργασίας",
        "weight": 20
      },
      {
        "category": "Ενδιάμεση Εξέταση",
        "weight": 30
      },
      {
        "category": "Τελική Εξέταση",
        "weight": 30
      }
    ]
  },
  {
    "course_code": "AUT0406",
    "course_name": "ΠΡΑΚΤΙΚΗ ΚΑΤΑΡΤΙΣΗ ΙΙ",
    "semester": "Δ' Εξάμηνο",
    "description": "**Στόχος:** Στόχος Μαθήματος H πρακτική άσκηση αποσκοπεί στην αρχική επαγγελματική κατάρτιση των σπουδαστών σε βασικές θέσεις εργασίας στον κλάδο της μηχανικής οχημάτων. Οι σπουδαστές θα αποκτήσουν σχετική εμπειρία και επιπρόσθετες γνώσεις και δεξιότητες συναφείς με το επάγγελμα. Επίσης, η πρακτική άσκηση θα δώσει στους σπουδαστές την ευκαιρία να εφαρμόσουν τις θεωρίες της τάξης στην πράξη εκτελώντας βασικά καθήκοντα και ευθύνες στον επιλεγμένο χώρο εργασίας. Τέλος, οι σπουδαστές θα είναι σε θέση να εξερευνήσουν τις προοπτικές της επαγγελματικής τους σταδιοδρομίας, να εξοικειωθούν με τις απαιτήσεις της βιομηχανίας για άμεση εργοδότηση καθώς επίσης και να ξεκινήσουν το δικό τους επαγγελματικό δίκτυο.\n\n**Μαθησιακά Αποτελέσματα:** Οι σπουδαστές/στριες θα είναι σε θέση να: • Αποκτήσουν βιομηχανική εμπειρία, • Αναπτύξουν βασικές επαγγελματικές ικανότητες, • Κατανοούν τη φύση, τις ευκαιρίες και τις απαιτήσεις του επαγγέλματος και της βιομηχανίας, • Δημιουργούν επαφές και σχέσεις με σημαντικούς επαγγελματίες του κλάδου. • Εκκινήσουν και θέσουν τις βάσεις για την εξέλιξη της επαγγελματικής τους σταδιοδρομία.\n\n**Περιεχόμενο:** Οι σπουδαστές θα ενεργοποιηθούν σε ένα από τους πιο κάτω τομείς: • Συνεργεία που υπάγονται σε αντιπροσωπίες οχημάτων, • Ανεξάρτητα συνεργεία,"
  }
]
